tests/load/artillery.yml
config:
  target: "https://www.intelliwavve.com"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"

scenarios:
  - name: "Homepage"
    flow:
      - get:
          url: "/"
      - get:
          url: "/wavecore-erp/auth/login"
      - get:
          url: "/api/wavecore/health"